## numpy package

In [1]:
import numpy as np

In [2]:
# array creation
arr = np.array([[1,2,3,4],[2,3,4,5],[3,4,5,6]])
print(arr)

[[1 2 3 4]
 [2 3 4 5]
 [3 4 5 6]]

In [3]:
# array manipulation
re_arr = arr.reshape(4,3)
re_arr

array([[1, 2, 3],
       [4, 2, 3],
       [4, 5, 3],
       [4, 5, 6]])

In [4]:
re_arr[:,2]

array([3, 3, 3, 6])

In [5]:
# mathematical operations
arr2 =  np.array([[1.0,2.8,3.2,4],[1.4,3,5.7,7.8],[3.2,4,5.1,6]])
arr2

array([[1. , 2.8, 3.2, 4. ],
       [1.4, 3. , 5.7, 7.8],
       [3.2, 4. , 5.1, 6. ]])

In [6]:
summ = np.add(arr,arr2)
summ

array([[ 2. ,  4.8,  6.2,  8. ],
       [ 3.4,  6. ,  9.7, 12.8],
       [ 6.2,  8. , 10.1, 12. ]])

In [7]:
sub = np.subtract(arr,arr2)
sub

array([[ 0. , -0.8, -0.2,  0. ],
       [ 0.6,  0. , -1.7, -2.8],
       [-0.2,  0. , -0.1,  0. ]])

In [8]:
mul = np.multiply(arr,arr2)
mul

array([[ 1. ,  5.6,  9.6, 16. ],
       [ 2.8,  9. , 22.8, 39. ],
       [ 9.6, 16. , 25.5, 36. ]])

In [9]:
div = np.divide(arr,arr2)
div

array([[1.        , 0.71428571, 0.9375    , 1.        ],
       [1.42857143, 1.        , 0.70175439, 0.64102564],
       [0.9375    , 1.        , 0.98039216, 1.        ]])

In [10]:
# Statistical analysis
np.mean(arr)

3.5

In [11]:
np.std(arr)

1.3844373104863459

In [12]:
np.min(re_arr)

1

In [13]:
np.max(re_arr)

6

## Pandas

In [15]:
import pandas as pd

In [16]:
# create series data object 
ps1 = pd.Series(['apple','hello','bye'])
ps1

0    apple
1    hello
2      bye
dtype: object

In [17]:
ps2 = pd.Series([3,1,4,1,4],['A','B','C','D','E'])
ps2 
# pd.Series([3,1,4,1,4],['A','B','D','E']) -> will raise an error

A    3
B    1
C    4
D    1
E    4
dtype: int64

In [19]:
ps3 = pd.Series([[1,2,34,5],['h','b','c']])
ps3

0    [1, 2, 34, 5]
1        [h, b, c]
dtype: object

In [25]:
# dataframe
data = {
    "sno" : [18,21,17,16,12,30,47,35,42,29,3],
    "name" : ['krishna','mohan','sai','raju','balu','manoj','ramesh','suresh','kumar','ravi','saketh']
}
df1 = pd.DataFrame(data)
# df1 all the data will be printed
df1.head(5) #displays first 5 rows

   sno     name
0   18  krishna
1   21    mohan
2   17      sai
3   16     raju
4   12     balu

In [27]:
df2 = pd.DataFrame({
    'rollno':[50,53,54,56,51],
    'name': ['Tanishq','priyanka','yamini','krishnaveni','yahid']
})
df2

   rollno         name
0      50      Tanishq
1      53     priyanka
2      54       yamini
3      56  krishnaveni
4      51        yahid

In [98]:
# Loading the csv file
ds = pd.read_csv('dataset.csv')
ds

    roll_no student_name     m1    m2     m3  total
0         1       ramesh   98.0  87.0   88.0    273
1         2       suresh    NaN  99.0   86.0    185
2         3       mahesh   86.0  69.0   94.0    249
3         4        kumar   54.0  93.0   78.0    225
4         5          sai   48.0  43.0   35.0    126
5         6          raj   76.0  77.0    NaN    153
6         7         ramu   88.0  88.0   88.0    264
7         8         deva  171.0  89.0   70.0    330
8         9    venkatesh   68.0   NaN   56.0    124
9         3       mahesh   86.0  69.0   94.0    249
10       11         nani  100.0  78.0   97.0    275
11       12        arjun   94.0  92.0  100.0    286
12       13       charan   84.0  99.0   94.0    277
13       14       kalyan  100.0  99.0  100.0    299
14        7         ramu   88.0  88.0   88.0    264

In [63]:
ds.head(5) #display first five rows

   roll_no student_name    m1    m2    m3  total
0        1       ramesh  98.0  87.0  88.0    273
1        2       suresh   NaN  99.0  86.0    185
2        3       mahesh  86.0  69.0  94.0    249
3        4        kumar  54.0  93.0  78.0    225
4        5          sai  48.0  43.0  35.0    126

In [64]:
ds.tail(3) #display last 3 rows

    roll_no student_name     m1    m2     m3  total
12       13       charan   84.0  99.0   94.0    277
13       14       kalyan  100.0  99.0  100.0    299
14        7         ramu   88.0  88.0   88.0    264

In [65]:
ds.loc[13]

roll_no             14
student_name    kalyan
m1               100.0
m2                99.0
m3               100.0
total              299
Name: 13, dtype: object

In [66]:
ds.columns=['Roll_no','Student_name','sub1_marks','sub2_marks','sub3_marks','Total']
# changing the names of the columns
ds

    Roll_no Student_name  sub1_marks  sub2_marks  sub3_marks  Total
0         1       ramesh        98.0        87.0        88.0    273
1         2       suresh         NaN        99.0        86.0    185
2         3       mahesh        86.0        69.0        94.0    249
3         4        kumar        54.0        93.0        78.0    225
4         5          sai        48.0        43.0        35.0    126
5         6          raj        76.0        77.0         NaN    153
6         7         ramu        88.0        88.0        88.0    264
7         8         deva       171.0        89.0        70.0    330
8         9    venkatesh        68.0         NaN        56.0    124
9         3       mahesh        86.0        69.0        94.0    249
10       11         nani       100.0        78.0        97.0    275
11       12        arjun        94.0        92.0       100.0    286
12       13       charan        84.0        99.0        94.0    277
13       14       kalyan       100.0        99.0       100.0    299
14        7         ramu        88.0        88.0        88.0    264

In [67]:
ds.sample(10) #displays random 10 rows

    Roll_no Student_name  sub1_marks  sub2_marks  sub3_marks  Total
6         7         ramu        88.0        88.0        88.0    264
7         8         deva       171.0        89.0        70.0    330
4         5          sai        48.0        43.0        35.0    126
14        7         ramu        88.0        88.0        88.0    264
13       14       kalyan       100.0        99.0       100.0    299
3         4        kumar        54.0        93.0        78.0    225
0         1       ramesh        98.0        87.0        88.0    273
10       11         nani       100.0        78.0        97.0    275
12       13       charan        84.0        99.0        94.0    277
11       12        arjun        94.0        92.0       100.0    286

In [68]:
ds.info() #gives the information about the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Roll_no       15 non-null     int64
 1   Student_name  15 non-null     object
 2   sub1_marks    14 non-null     float64
 3   sub2_marks    14 non-null     float64
 4   sub3_marks    14 non-null     float64
 5   Total         15 non-null     int64
dtypes: float64(3), int64(2), object(1)
memory usage: 852.0+ bytes

In [69]:
ds.describe()#gives the desciption about the dataset

         Roll_no  sub1_marks  sub2_marks  sub3_marks       Total
count  15.000000   14.000000   14.000000   14.000000   15.000000
mean    7.000000   88.642857   83.571429   83.428571  238.600000
std     4.123106   28.596953   15.440777   18.492054   63.209177
min     1.000000   48.000000   43.000000   35.000000  124.000000
25%     3.500000   78.000000   77.250000   80.000000  205.000000
50%     7.000000   87.000000   88.000000   88.000000  264.000000
75%    10.000000   97.000000   92.750000   94.000000  276.000000
max    14.000000  171.000000   99.000000  100.000000  330.000000

In [70]:
ds.nunique() # displays number of unique values in all the columns

Roll_no         13
Student_name    13
sub1_marks      11
sub2_marks      10
sub3_marks       9
Total           13
dtype: int64

In [71]:
print(ds['sub3_marks'].unique) #displays unique values in the column

<bound method Series.unique of 0      88.0
1      86.0
2      94.0
3      78.0
4      35.0
5       NaN
6      88.0
7      70.0
8      56.0
9      94.0
10     97.0
11    100.0
12     94.0
13    100.0
14     88.0
Name: sub3_marks, dtype: float64>

In [99]:
ds.value_counts() # frequency of the each row in the dataset

roll_no  student_name  m1     m2    m3     total
3        mahesh        86.0   69.0  94.0   249      2
7        ramu          88.0   88.0  88.0   264      2
1        ramesh        98.0   87.0  88.0   273      1
4        kumar         54.0   93.0  78.0   225      1
5        sai           48.0   43.0  35.0   126      1
8        deva          171.0  89.0  70.0   330      1
11       nani          100.0  78.0  97.0   275      1
12       arjun         94.0   92.0  100.0  286      1
13       charan        84.0   99.0  94.0   277      1
14       kalyan        100.0  99.0  100.0  299      1
Name: count, dtype: int64

In [100]:
ds['m3'].value_counts() #frequency of each row in the m3 column

m3
88.0     3
94.0     3
100.0    2
86.0     1
78.0     1
35.0     1
70.0     1
56.0     1
97.0     1
Name: count, dtype: int64

In [72]:
ds.shape # shape of the dataset is displayed

(15, 6)

In [73]:
ds.isna() # returns true when there is a null value

    Roll_no  Student_name  sub1_marks  sub2_marks  sub3_marks  Total
0     False         False       False       False       False  False
1     False         False        True       False       False  False
2     False         False       False       False       False  False
3     False         False       False       False       False  False
4     False         False       False       False       False  False
5     False         False       False       False        True  False
6     False         False       False       False       False  False
7     False         False       False       False       False  False
8     False         False       False        True       False  False
9     False         False       False       False       False  False
10    False         False       False       False       False  False
11    False         False       False       False       False  False
12    False         False       False       False       False  False
13    False         False       False       False       False  False
14    False         False       False       False       False  False

In [74]:
# accesing the columns using iloc
print(ds.iloc[2:6,3:5])

   sub2_marks  sub3_marks
2        69.0        94.0
3        93.0        78.0
4        43.0        35.0
5        77.0         NaN

In [75]:
# Cleaning the dataset
ds1 = ds.dropna() #removes the rows with null value
# ds.dropna(inplace=True) -> original dataset will also be changed
ds1

    Roll_no Student_name  sub1_marks  sub2_marks  sub3_marks  Total
0         1       ramesh        98.0        87.0        88.0    273
2         3       mahesh        86.0        69.0        94.0    249
3         4        kumar        54.0        93.0        78.0    225
4         5          sai        48.0        43.0        35.0    126
6         7         ramu        88.0        88.0        88.0    264
7         8         deva       171.0        89.0        70.0    330
9         3       mahesh        86.0        69.0        94.0    249
10       11         nani       100.0        78.0        97.0    275
11       12        arjun        94.0        92.0       100.0    286
12       13       charan        84.0        99.0        94.0    277
13       14       kalyan       100.0        99.0       100.0    299
14        7         ramu        88.0        88.0        88.0    264

In [76]:
ds2 = ds.fillna('ab') #replacing the null values with ab
print(ds2)

    Roll_no Student_name sub1_marks sub2_marks sub3_marks  Total
0         1       ramesh       98.0       87.0       88.0    273
1         2       suresh         ab       99.0       86.0    185
2         3       mahesh       86.0       69.0       94.0    249
3         4        kumar       54.0       93.0       78.0    225
4         5          sai       48.0       43.0       35.0    126
5         6          raj       76.0       77.0         ab    153
6         7         ramu       88.0       88.0       88.0    264
7         8         deva      171.0       89.0       70.0    330
8         9    venkatesh       68.0         ab       56.0    124
9         3       mahesh       86.0       69.0       94.0    249
10       11         nani      100.0       78.0       97.0    275
11       12        arjun       94.0       92.0      100.0    286
12       13       charan       84.0       99.0       94.0    277
13       14       kalyan      100.0       99.0      100.0    299
14        7         ramu       88.0       88.0       88.0    264

In [77]:
# Handling wrong data
ds3 = ds.drop(7) #removes the row
ds3

    Roll_no Student_name  sub1_marks  sub2_marks  sub3_marks  Total
0         1       ramesh        98.0        87.0        88.0    273
1         2       suresh         NaN        99.0        86.0    185
2         3       mahesh        86.0        69.0        94.0    249
3         4        kumar        54.0        93.0        78.0    225
4         5          sai        48.0        43.0        35.0    126
5         6          raj        76.0        77.0         NaN    153
6         7         ramu        88.0        88.0        88.0    264
8         9    venkatesh        68.0         NaN        56.0    124
9         3       mahesh        86.0        69.0        94.0    249
10       11         nani       100.0        78.0        97.0    275
11       12        arjun        94.0        92.0       100.0    286
12       13       charan        84.0        99.0        94.0    277
13       14       kalyan       100.0        99.0       100.0    299
14        7         ramu        88.0        88.0        88.0    264

In [84]:
ds.loc[7,'sub1_marks'] = 71 
ds.loc[7,'Total']=230#replacing the value
ds

    Roll_no Student_name  sub1_marks  sub2_marks  sub3_marks  Total
0         1       ramesh        98.0        87.0        88.0    273
1         2       suresh         NaN        99.0        86.0    185
2         3       mahesh        86.0        69.0        94.0    249
3         4        kumar        54.0        93.0        78.0    225
4         5          sai        48.0        43.0        35.0    126
5         6          raj        76.0        77.0         NaN    153
6         7         ramu        88.0        88.0        88.0    264
7         8         deva        71.0        89.0        70.0    230
8         9    venkatesh        68.0         NaN        56.0    124
9         3       mahesh        86.0        69.0        94.0    249
10       11         nani       100.0        78.0        97.0    275
11       12        arjun        94.0        92.0       100.0    286
12       13       charan        84.0        99.0        94.0    277
13       14       kalyan       100.0        99.0       100.0    299
14        7         ramu        88.0        88.0        88.0    264

In [85]:
#removing duplicates
print(ds.duplicated()) #checking whether there are duplicates or not

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13    False
14     True
dtype: bool

In [86]:
print(ds.drop_duplicates())

    Roll_no Student_name  sub1_marks  sub2_marks  sub3_marks  Total
0         1       ramesh        98.0        87.0        88.0    273
1         2       suresh         NaN        99.0        86.0    185
2         3       mahesh        86.0        69.0        94.0    249
3         4        kumar        54.0        93.0        78.0    225
4         5          sai        48.0        43.0        35.0    126
5         6          raj        76.0        77.0         NaN    153
6         7         ramu        88.0        88.0        88.0    264
7         8         deva        71.0        89.0        70.0    230
8         9    venkatesh        68.0         NaN        56.0    124
10       11         nani       100.0        78.0        97.0    275
11       12        arjun        94.0        92.0       100.0    286
12       13       charan        84.0        99.0        94.0    277
13       14       kalyan       100.0        99.0       100.0    299

In [87]:
print(ds['Total'].mean()) #mean of total column

231.93333333333334

In [88]:
print(ds['Total'].median()) #median of total column

249.0

In [90]:
print(ds['sub3_marks'].mode()) #mode of sub3_marks column

0    88.0
1    94.0
Name: sub3_marks, dtype: float64

In [91]:
print(ds['Total'].std()) #standard deviation of total column

57.934034737383705

In [92]:
print(ds['Total'].var()) #variance of total column

3356.3523809523817

In [97]:
print(ds.corr(numeric_only=True))

             Roll_no  sub1_marks  sub2_marks  sub3_marks     Total
Roll_no     1.000000    0.308882    0.357350    0.230514  0.337305
sub1_marks  0.308882    1.000000    0.462038    0.849239  0.784252
sub2_marks  0.357350    0.462038    1.000000    0.629608  0.569520
sub3_marks  0.230514    0.849239    0.629608    1.000000  0.892180
Total       0.337305    0.784252    0.569520    0.892180  1.000000